server/test/api/jmeter/AgencyCase.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <boolProp name="HTTPArgument.use_equals">true</boolProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.domain">127.0.0.1</stringProp>
        <stringProp name="HTTPSampler.port">3000</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1556522442000</longProp>
        <longProp name="ThreadGroup.end_time">1556522442000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Admin Login" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;email&quot;: &quot;support@comcate.com&quot;,&#xd;
  &quot;password&quot;: &quot;test@123&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">admin/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Admin Token" enabled="true">
          <stringProp name="RegexExtractor.useHeaders">false</stringProp>
          <stringProp name="RegexExtractor.refname">admin_token</stringProp>
          <stringProp name="RegexExtractor.regex">&quot;token&quot;:&quot;(.+?)&quot;</stringProp>
          <stringProp name="RegexExtractor.template">$1$</stringProp>
          <stringProp name="Sample.scope">all</stringProp>
        </RegexExtractor>
        <hashTree/>
        <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">${__setProperty(admin_token,${admin_token})}</stringProp>
        </BeanShellPostProcessor>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1549113883000</longProp>
        <longProp name="ThreadGroup.end_time">1549113883000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Admin Header" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__property(admin_token)}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Super Admin Login - Agency 1" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">admin/agencies/1/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Super Admin Token" enabled="true">
          <stringProp name="RegexExtractor.useHeaders">false</stringProp>
          <stringProp name="RegexExtractor.refname">super_admin_token</stringProp>
          <stringProp name="RegexExtractor.regex">&quot;token&quot;:&quot;(.+?)&quot;</stringProp>
          <stringProp name="RegexExtractor.template">$1$</stringProp>
          <stringProp name="Scope.variable">super_admin_token11</stringProp>
          <stringProp name="Sample.scope">all</stringProp>
        </RegexExtractor>
        <hashTree/>
        <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="true">
          <boolProp name="resetInterpreter">false</boolProp>
          <stringProp name="script">${__setProperty(super_admin_token,${super_admin_token})}</stringProp>
        </BeanShellPostProcessor>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loop,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,100)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(duration,100)}</stringProp>
        <longProp name="ThreadGroup.start_time">1556522218000</longProp>
        <longProp name="ThreadGroup.end_time">1556522218000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Super Admin Header" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__property(super_admin_token)}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Case - Agency 1" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;assigneeId&quot;:1,&#xd;
  &quot;inspectionAssigneeId&quot;: 1,&#xd;
  &quot;inspectionDate&quot;:&quot;2019-08-30T17:12:23.561Z&quot;,&#xd;
  &quot;issueDescription&quot;: &quot;This is my issue description.&quot;,&#xd;
  &quot;location&quot;: {&#xd;
    &quot;streetAddress&quot;: &quot;547,Alabama&quot;,&#xd;
    &quot;city&quot;: &quot;Alabama&quot;,&#xd;
    &quot;state&quot;: &quot;AL&quot;,&#xd;
    &quot;zip&quot;: &quot;94016&quot;,&#xd;
    &quot;latitude&quot;:34.0401465212326,&#xd;
    &quot;longitude&quot;:-78.0749587334245,&#xd;
    &quot;flagAddress&quot;: {&#xd;
	    &quot;isFlagged&quot;: true,&#xd;
	    &quot;reasonForFlagging&quot;: &quot;test reason&quot;&#xd;
    },&#xd;
    &quot;isCDBGEligible&quot;: false,&#xd;
    &quot;isCDBGApproved&quot;: false,&#xd;
    &quot;parcelFields&quot;: {&#xd;
    },&#xd;
    &quot;manualFields&quot;: {&#xd;
    	&quot;Ward&quot;:&quot;Ward I&quot;,&#xd;
    	&quot;Lot&quot;: 23,&#xd;
    	&quot;Block&quot;: 1&#xd;
    }&#xd;
  },&#xd;
  &quot;attachments&quot;: [&#xd;
      {&#xd;
          &quot;title&quot;: &quot;This is PNG attachment &quot;,&#xd;
          &quot;description&quot;: &quot;this is a description&quot;,&#xd;
          &quot;fileName&quot;: &quot;This is a file name1&quot;,&#xd;
          &quot;fileSize&quot;: &quot;20KB&quot;,&#xd;
          &quot;fileURL&quot;: &quot;https://cyberdyne-dev.s3.amazonaws.com/agency_1/staging/cases/actionspopup.png&quot;&#xd;
      }&#xd;
  ],&#xd;
  &quot;violations&quot;: [&#xd;
  	{&#xd;
  		&quot;configXerceViolationId&quot;: 1,&#xd;
  		&quot;entities&quot;: [&#xd;
  			{&#xd;
	  			&quot;Animal Colour&quot;: &quot;Black&quot;,&#xd;
	  			&quot;License Number&quot;: &quot;1234&quot;,&#xd;
	  			&quot;Age&quot;: 12,&#xd;
	  			&quot;Breed&quot;: &quot;&quot;,&#xd;
	  			&quot;Note&quot;: &quot;&quot;&#xd;
  			}&#xd;
  		]&#xd;
  	},&#xd;
  	{&#xd;
  		&quot;configXerceViolationId&quot;: 2,&#xd;
  		&quot;entities&quot;: [&#xd;
  			{&#xd;
	  			&quot;Vehicle Color&quot;: &quot;Black&quot;,&#xd;
	  			&quot;License Number&quot;: &quot;1234&quot;,&#xd;
	  			&quot;Model Number&quot;: 12,&#xd;
	  			&quot;Note&quot;: &quot;&quot;&#xd;
  			}&#xd;
  		]&#xd;
  	},&#xd;
  	{&#xd;
  		&quot;configXerceViolationId&quot;: 3,&#xd;
  		&quot;entities&quot;: [&#xd;
  			{&#xd;
	  			&quot;Vehicle Color&quot;: &quot;Blue&quot;,&#xd;
	  			&quot;License Number&quot;: &quot;5678&quot;,&#xd;
	  			&quot;Model Number&quot;: 11,&#xd;
	  			&quot;Note&quot;: &quot;&quot;&#xd;
  			}&#xd;
  		]&#xd;
  	}&#xd;
  ],&#xd;
  &quot;customCaseFieldValues&quot;: [&#xd;
  	{&#xd;
          &quot;Property Lien&quot;: {&#xd;
              &quot;Start Date&quot;: &quot;2017-08-30&quot;,&#xd;
              &quot;End Date&quot;: &quot;2022-08-30&quot;,&#xd;
              &quot;Property Lien Type&quot;: &quot;Long Term&quot;,&#xd;
              &quot;Property Lien By&quot;: &quot;Mr. jhon Doe&quot;&#xd;
          }&#xd;
      }&#xd;
   ],&#xd;
   &quot;contacts&quot;: [&#xd;
   	{&#xd;
   		&quot;id&quot;: 1,&#xd;
   		&quot;isBillable&quot;: false&#xd;
   	}&#xd;
   	]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">xerce/cases</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Case Id" enabled="true">
          <stringProp name="RegexExtractor.useHeaders">false</stringProp>
          <stringProp name="RegexExtractor.refname">case_id</stringProp>
          <stringProp name="RegexExtractor.regex">&quot;id&quot;:(.*?),</stringProp>
          <stringProp name="RegexExtractor.template">$1$</stringProp>
          <stringProp name="RegexExtractor.match_number">1</stringProp>
          <stringProp name="Scope.variable">super_admin_token11</stringProp>
          <stringProp name="Sample.scope">all</stringProp>
        </RegexExtractor>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Case - Agency 1" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">xerce/cases/${case_id}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract First Case Violation Id" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">case_violation_1</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.caseViolations[0].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Second Case Violation Id" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">case_violation_2</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.caseViolations[1].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Third Case Violation Id" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">case_violation_3</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.caseViolations[2].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Inspection Id" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">inspection_id</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.inspections[0].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Perform Inspection - Agency 1" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;existingViolations&quot;: [&#xd;
		{&#xd;
			&quot;caseViolationId&quot;: ${case_violation_1},&#xd;
			&quot;status&quot;: &quot;OPEN&quot;,&#xd;
			&quot;entity&quot;: {&#xd;
				&quot;Animal Colour&quot;: &quot;RED&quot;,&#xd;
	  			&quot;License Number&quot;: &quot;1234&quot;,&#xd;
	  			&quot;Age&quot;: 12,&#xd;
	  			&quot;Breed&quot;: &quot;&quot;,&#xd;
	  			&quot;Note&quot;: &quot;&quot;&#xd;
			},&#xd;
			&quot;complyByDate&quot;: &quot;2019-08-30T17:12:23.561Z&quot;&#xd;
		},&#xd;
		{&#xd;
			&quot;caseViolationId&quot;: ${case_violation_2},&#xd;
			&quot;status&quot;: &quot;OPEN&quot;,&#xd;
			&quot;entity&quot;: {&#xd;
	  			&quot;Vehicle Color&quot;: &quot;Black&quot;,&#xd;
	  			&quot;License Number&quot;: &quot;1234&quot;,&#xd;
	  			&quot;Model Number&quot;: 12,&#xd;
	  			&quot;Note&quot;: &quot;&quot;&#xd;
  			},&#xd;
			&quot;complyByDate&quot;: &quot;2019-08-30T17:12:23.561Z&quot;&#xd;
		},&#xd;
		{&#xd;
			&quot;caseViolationId&quot;: ${case_violation_3},&#xd;
			&quot;status&quot;: &quot;OPEN&quot;,&#xd;
			&quot;entity&quot;: {&#xd;
	  			&quot;Vehicle Color&quot;: &quot;Black&quot;,&#xd;
	  			&quot;License Number&quot;: &quot;1234&quot;,&#xd;
	  			&quot;Model Number&quot;: 12,&#xd;
	  			&quot;Note&quot;: &quot;&quot;&#xd;
  			},&#xd;
			&quot;complyByDate&quot;: &quot;2019-08-30T17:12:23.561Z&quot;&#xd;
		}&#xd;
	],&#xd;
	&quot;newViolations&quot;: [&#xd;
	],&#xd;
	&quot;noteContent&quot;: &quot;Its an inspection note&quot;,&#xd;
	&quot;attachments&quot;: [&#xd;
		{&#xd;
          &quot;title&quot;: &quot;This is PNG attachment &quot;,&#xd;
          &quot;description&quot;: &quot;inspection attachment description&quot;,&#xd;
          &quot;fileName&quot;: &quot;inspectionFile&quot;,&#xd;
          &quot;fileSize&quot;: &quot;20KB&quot;,&#xd;
          &quot;fileURL&quot;: &quot;https://cyberdyne-dev.s3.amazonaws.com/agency_1/staging/cases/No_data_1548759010921.png&quot;&#xd;
    	}	&#xd;
	],&#xd;
	&quot;scheduledInspection&quot;: {&#xd;
		&quot;plannedDate&quot;: &quot;2019-08-30T17:12:23.561Z&quot;,&#xd;
		&quot;assigneeId&quot;: 1&#xd;
	},&#xd;
	&quot;notice&quot;: {&#xd;
		&quot;issuedAt&quot;: &quot;2019-08-30T17:12:23.561Z&quot;,&#xd;
		&quot;configNoticeId&quot;: 1&#xd;
	}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">xerce/cases/${case_id}/perform-inspections/${inspection_id}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/home/ishan/Cyberdyne/result_6.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/home/ishan/Cyberdyne/result_6.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">/home/ishan/Cyberdyne/result_5.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>